fio/fio_disk/disk_xfs/log/RAID0/log_38/sdi/fio_randwrite_04k.log
test: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
fio-3.1
Starting 1 process

test: (groupid=0, jobs=1): err= 0: pid=7345: Tue Jul 24 18:46:12 2018
  write: IOPS=219, BW=879KiB/s (900kB/s)(1024MiB/1193341msec)
    slat (usec): min=4, max=110, avg=26.17, stdev= 9.87
    clat (usec): min=377, max=1845.3k, avg=291309.40, stdev=197097.48
     lat (usec): min=413, max=1845.3k, avg=291336.02, stdev=197099.11
    clat percentiles (msec):
     |  1.00th=[   15],  5.00th=[   22], 10.00th=[   34], 20.00th=[  144],
     | 30.00th=[  190], 40.00th=[  228], 50.00th=[  266], 60.00th=[  305],
     | 70.00th=[  351], 80.00th=[  414], 90.00th=[  550], 95.00th=[  684],
     | 99.00th=[  919], 99.50th=[ 1028], 99.90th=[ 1217], 99.95th=[ 1284],
     | 99.99th=[ 1502]
   bw (  KiB/s): min=   16, max= 1907, per=100.00%, avg=887.78, stdev=320.31, samples=2363
   iops        : min=    4, max=  476, avg=221.92, stdev=80.07, samples=2363
  lat (usec)   : 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.13%, 20=3.74%, 50=8.53%
  lat (msec)   : 100=3.15%, 250=30.50%, 500=41.14%, 750=9.60%, 1000=2.61%
  lat (msec)   : 2000=0.58%
  cpu          : usr=0.26%, sys=0.85%, ctx=261350, majf=0, minf=28
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwt: total=0,262144,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=879KiB/s (900kB/s), 879KiB/s-879KiB/s (900kB/s-900kB/s), io=1024MiB (1074MB), run=1193341-1193341msec

Disk stats (read/write):
  sdi: ios=0/262198, merge=0/3, ticks=0/76373874, in_queue=76382098, util=100.00%